In [32]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [33]:
dframe = DataFrame({"k1":["X","X","Y","Y","Z"],
                   "k2":["alpha","beta","alpha","beta","alpha"],
                   "dataset1":np.random.randn(5),
                   "dataset2":np.random.randn(5)})

dframe

   dataset1  dataset2 k1     k2
0 -1.622423 -0.655226  X  alpha
1  1.034090 -0.708043  X   beta
2  0.704743 -0.184829  Y  alpha
3  0.545794 -0.805649  Y   beta
4 -0.304882  0.863684  Z  alpha

In [34]:
# grab dataset1 columns and group by k1 columns

group1 = dframe["dataset1"].groupby(dframe["k1"])

In [35]:
group1

In [36]:
# get the mean of group1 by each of its key k1
group1.mean()

k1
X   -0.294166
Y    0.625268
Z   -0.304882
Name: dataset1, dtype: float64

In [37]:
cities = np.array(["NY","LA","LA","NY","NY"])

month = np.array(["Jan","FEB","JAN","FEB","JAN"])

In [38]:
dframe["dataset1"].groupby([cities,month]).mean()

LA  FEB    1.034090
    JAN    0.704743
NY  FEB    0.545794
    JAN   -0.304882
    Jan   -1.622423
Name: dataset1, dtype: float64

In [39]:
dframe

   dataset1  dataset2 k1     k2
0 -1.622423 -0.655226  X  alpha
1  1.034090 -0.708043  X   beta
2  0.704743 -0.184829  Y  alpha
3  0.545794 -0.805649  Y   beta
4 -0.304882  0.863684  Z  alpha

In [40]:
dframe.groupby("k1").mean()

    dataset1  dataset2
k1
X  -0.294166 -0.681634
Y   0.625268 -0.495239
Z  -0.304882  0.863684

In [41]:
# group by multiple columns

dframe.groupby(["k1","k2"]).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.622423 -0.655226
   beta   1.034090 -0.708043
Y  alpha  0.704743 -0.184829
   beta   0.545794 -0.805649
Z  alpha -0.304882  0.863684

In [42]:
# get the size or number of objects in each category or key

dframe.groupby(["k1"]).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [43]:
for name,group in dframe.groupby("k1"):
    print ("This is the %s group" %name)
    print (group)
    print ("\n")

This is the X group
   dataset1  dataset2 k1     k2
0 -1.622423 -0.655226  X  alpha
1  1.034090 -0.708043  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.704743 -0.184829  Y  alpha
3  0.545794 -0.805649  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.304882  0.863684  Z  alpha

In [44]:
for (k1,k2),group in dframe.groupby(["k1","k2"]):
    print ('key1 = %s key2 = %s' %(k1,k2))
    print (group)
    print ("\n")

key1 = X key2 = alpha
   dataset1  dataset2 k1     k2
0 -1.622423 -0.655226  X  alpha


key1 = X key2 = beta
   dataset1  dataset2 k1    k2
1   1.03409 -0.708043  X  beta


key1 = Y key2 = alpha
   dataset1  dataset2 k1     k2
2  0.704743 -0.184829  Y  alpha


key1 = Y key2 = beta
   dataset1  dataset2 k1    k2
3  0.545794 -0.805649  Y  beta


key1 = Z key2 = alpha
   dataset1  dataset2 k1     k2
4 -0.304882  0.863684  Z  alpha

In [45]:
dframe

   dataset1  dataset2 k1     k2
0 -1.622423 -0.655226  X  alpha
1  1.034090 -0.708043  X   beta
2  0.704743 -0.184829  Y  alpha
3  0.545794 -0.805649  Y   beta
4 -0.304882  0.863684  Z  alpha

In [46]:
group_dict = dict(list(dframe.groupby("k1")))

In [47]:
group_dict["X"]

   dataset1  dataset2 k1     k2
0 -1.622423 -0.655226  X  alpha
1  1.034090 -0.708043  X   beta

In [53]:
# separate the data by its types
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [52]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -1.622423 -0.655226
 1  1.034090 -0.708043
 2  0.704743 -0.184829
 3  0.545794 -0.805649
 4 -0.304882  0.863684, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [54]:
# group a set of data by two different keys

dataset2_group = dframe.groupby(["k1","k2"])[["dataset2"]]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.655226
   beta  -0.708043
Y  alpha -0.184829
   beta  -0.805649
Z  alpha  0.863684